-- MySQL dump 10.13  Distrib 5.6.25, for osx10.10 (x86_64)
--
-- Host: localhost    Database: freshycamp
-- ------------------------------------------------------
-- Server version	5.6.25

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `register`
--

DROP TABLE IF EXISTS `register`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `register` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `student_id` varchar(10) NOT NULL,
  `name` varchar(255) NOT NULL,
  `gender` varchar(1) NOT NULL DEFAULT 'M',
  `branch` varchar(3) NOT NULL DEFAULT 'CPE',
  `attendance` int(1) NOT NULL DEFAULT '0',
  `color` int(1) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  UNIQUE KEY `student_id_UNIQUE` (`student_id`)
) ENGINE=InnoDB AUTO_INCREMENT=393 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `register`
--

LOCK TABLES `register` WRITE;
/*!40000 ALTER TABLE `register` DISABLE KEYS */;
INSERT INTO `register` VALUES (268,'5810500102','คฑาวุฒิ ชัยประพันธ์','M','CPE',0,NULL),(269,'5810500111','จิตภัทร นวรัตนาพงษ์','M','CPE',0,NULL),(270,'5810500129','นิติ สันติกุล','M','CPE',0,NULL),(271,'5810500137','ภิญญพร เอี่ยมมงคล','F','CPE',0,NULL),(272,'5810500145','ศุภกฤษฏิ์ เกรียงขจร','M','CPE',0,NULL),(273,'5810500293','ภวิศณัฏฐ์ เลิศพงศ์รุจิกร','M','CPE',0,NULL),(274,'5810500307','แววปราชญ์ สุธิราวุธ','M','CPE',0,NULL),(275,'5810503411','นล ณ สงขลา','M','CPE',0,NULL),(276,'5810500412','คมคณิต สัจจอุตตรา','M','CPE',0,NULL),(277,'5810500421','ชญานิน ทองผาสุข','F','CPE',0,NULL),(278,'5810500439','แดนไท ลิ้มลาวัลย์','M','CPE',0,NULL),(279,'5810500447','หฤษฎ์ มูลพันธ์','M','CPE',0,NULL),(280,'5810500471','อสมาภรณ์ จันทรสกุล','F','CPE',0,NULL),(281,'5810502237','คณาธิป ตั้งหลักชัย','M','CPE',0,NULL),(282,'5810502245','จักรพงษ์ คล้ายหนองสรวง','M','CPE',0,NULL),(283,'5810502253','จิรฑีปต์ ตันติสุวรรณกุล','M','CPE',0,NULL),(284,'5810502261','ฉันทพัฒน์ กิตติรุจิรัตน์','M','CPE',0,NULL),(285,'5810502270','ชานนท์ อึ้งปัญสัตวงศ์','M','CPE',0,NULL),(286,'5810502288','ณฐฐ์ภพ ภัทรธนาธร','M','CPE',0,NULL),(287,'5810502296','ณัฐชนันท์ ทองเต็ม','M','CPE',0,NULL),(288,'5810502300','ณัฐนรี อัศวเสรี','F','CPE',0,NULL),(289,'5810502318','ณัฐพงศ์ สรรพกิจชาญชัย','M','CPE',0,NULL),(290,'5810502326','ณัฐพล จีรเธียรนาถ','M','CPE',0,NULL),(291,'5810502334','ธนกานต์ ปราโมทย์','M','CPE',0,NULL),(292,'5810502342','ธนวัต ชนิกาภรณ์','M','CPE',0,NULL),(293,'5810502351','ธัญจิรา สุกกรี','F','CPE',0,NULL),(294,'5810502369','นิธิศ เพชรมนมะดัน','M','CPE',0,NULL),(295,'5810502377','ปณต ลีลางามวงศา','M','CPE',0,NULL),(296,'5810502385','พสกร เรืองแสงรอบ','M','CPE',0,NULL),(297,'5810502393','พูนศักดิ์ นุชศิริ','M','CPE',0,NULL),(298,'5810502407','มณฑล จรัสตระกูล','M','CPE',0,NULL),(299,'5810502415','มนัสนันท์ วัฒนสกลพันธุ์','F','CPE',0,NULL),(300,'5810502423','รัฐศาสตร์ เหลาแตว','M','CPE',0,NULL),(301,'5810502431','วัชรฉัตร แปลงศรี','M','CPE',0,NULL),(302,'5810502440','วิลาวัลย์ ลีลาประทักษ์','F','CPE',0,NULL),(303,'5810502458','ศุภกร รังษีไสวแสง','M','CPE',0,NULL),(304,'5810502466','ศุภณัฐ แก้วบุญเรือง','M','CPE',0,NULL),(305,'5810502474','สารัช รุจิรานุรักษ์','M','CPE',0,NULL),(306,'5810502482','สุทธิธรรม เกิดจนา','M','CPE',0,NULL),(307,'5810502504','เอกรัตน์ สถิตย์วัฒนาสันติ์','M','CPE',0,NULL),(308,'5810504353','กนกทัช นิลคล้ำ','M','CPE',0,NULL),(309,'5810504361','กนกพล กุลศรี','M','CPE',0,NULL),(310,'5810504370','คณุตม์ อินทร์ใจเอื้อ','M','CPE',0,NULL),(311,'5810504388','จิรพนธ์ สอิ้งทอง','M','CPE',0,NULL),(312,'5810504396','ฉัตรทิวา คณะรัฐ','F','CPE',0,NULL),(313,'5810504418','ชวิศ สุขพูล','M','CPE',0,NULL),(314,'5810504426','ฐิตา ทรงศิลป์','F','CPE',0,NULL),(315,'5810504434','ณัฐจิต ศรีขจรลาภ','F','CPE',0,NULL),(316,'5810504442','ณัฐพล ฉันทสิริวรวัฒน์','M','CPE',0,NULL),(317,'5810504451','เทพสุนันท์ ลิมปพยอม','M','CPE',0,NULL),(318,'5810504469','ธัชนนท์ น่าบัณฑิต','M','CPE',0,NULL),(319,'5810504477','นิติธร เสงี่ยมพงศ์','M','CPE',0,NULL),(320,'5810504485','ปณิดา คุปต์หิรัณย์','F','CPE',0,NULL),(321,'5810504493','พิสิษฐ์ ศรีจันทร์','M','CPE',0,NULL),(322,'5810504507','พีรพงศ์ ตะวันทวีกิจ','M','CPE',0,NULL),(323,'5810504515','พุทธินัย เข็มจินดา','M','CPE',0,NULL),(324,'5810504523','ภากร ชุตินิมิตกุล','M','CPE',0,NULL),(325,'5810504531','มนปริยา ธรรมวงศ์','F','CPE',0,NULL),(326,'5810504540','วชร เล็กมณี','M','CPE',0,NULL),(327,'5810504558','วสุธร ศิริยากร','M','CPE',0,NULL),(328,'5810504566','ศุภพล ชอบธรรมสกุล','M','CPE',0,NULL),(329,'5810504574','สิวะนนท์ สิทธินาม','M','CPE',0,NULL),(330,'5810504582','สุทธิภัทร สุขวัฒนากรณ์','M','CPE',0,NULL),(331,'5810504591','สุพัฒ หวังสู่วัฒนา','M','CPE',0,NULL),(332,'5810504612','อภิชญา เด่นถาวร','F','CPE',0,NULL),(333,'5810504621','อภิสิทธิ์ เล็กสมบูรณ์','M','CPE',0,NULL),(334,'5810504639','โอฬาร สงวนประสิทธิ์','M','CPE',0,NULL),(335,'5810545831','กิตติภัทร ทรัพย์สมบูรณ์','M','SKE',0,NULL),(336,'5810545840','คีตวัฒน์ ศรีชมภู','M','SKE',0,NULL),(337,'5810545858','ณนงค์ศักดิ์ จบศรี','M','SKE',0,NULL),(338,'5810545866','ณัชฤตา สี่หิรัญวงศ์','F','SKE',0,NULL),(339,'5810545874','ณัฏฐ์คเณศ เลิศพงศ์รุจิกร','M','SKE',0,NULL),(340,'5810545882','ณัฐพล พิมพ์ไชย','M','SKE',0,NULL),(341,'5810545891','ธนวรรณ เศียรอินทร์','F','SKE',0,NULL),(342,'5810545904','ธนวัต แซ่หลี','M','SKE',0,NULL),(343,'5810545912','ธราธร ธีรลดา','M','SKE',0,NULL),(344,'5810545921','ธีรภัทร ศุภอารีย์','M','SKE',0,NULL),(345,'5810545947','บุศน้ำเพชร อ่อนมี','F','SKE',0,NULL),(346,'5810545955','เบญญาภา ซื่อสัตตบงกช','F','SKE',0,NULL),(347,'5810545971','พิทักษ์พงษ์ มุ่งทวีสินสุข','M','SKE',0,NULL),(348,'5810545980','พิสิษฐ์ สถานเดิม','M','SKE',0,NULL),(349,'5810545998','ฟ้าใส ราชมนเฑียร','F','SKE',0,NULL),(350,'5810546005','รอยบุญ ไชยชิต','M','SKE',0,NULL),(351,'5810546013','รักกัลป์ เตี๋ยสกุล','F','SKE',0,NULL),(352,'5810546021','วิศรุต บุญนำมา','M','SKE',0,NULL),(353,'5810546048','เศรษฐพงศ์ เปี่ยมลือ','M','SKE',0,NULL),(354,'5810546056','โสรยา แสนนา','F','SKE',0,NULL),(355,'5810546064','อธิษฐ์ ศรีสุคันธพฤกษ์','M','SKE',0,NULL),(356,'5810545033','นัทธพงศ์ โรจนวานิช','M','SKE',0,NULL),(357,'5810546552','กมนทัต จันทราจีระธำรงค์','M','SKE',0,NULL),(358,'5810546561','กฤตภัค เมฆพงษ์สาโรจน์','M','SKE',0,NULL),(359,'5810546579','กษิดิศ พลวรรณาภา','M','SKE',0,NULL),(360,'5810546587','กันต์ กมลานนท์','M','SKE',0,NULL),(361,'5810546595','โกเมน ศรีธเนศชัย','M','SKE',0,NULL),(362,'5810546609','คณุตม์ชน อัมวงษ์','M','SKE',0,NULL),(363,'5810546617','จิรายุทธ ลีอุปถัมภ์วงศ์','M','SKE',0,NULL),(364,'5810546625','ชนน เจนาคม','M','SKE',0,NULL),(365,'5810546641','ณัฐพล สินทวีเลิศ','M','SKE',0,NULL),(366,'5810546650','ณัฐภัทรพรหม ชองอมรกุลประภา','M','SKE',0,NULL),(367,'5810546668','ทัศนันท์ กิติศรีรุ่งเรือง','F','SKE',0,NULL),(368,'5810546676','ธัญญา วิทยสิริไพบูลย์','F','SKE',0,NULL),(369,'5810546684','นภนต์ กิตติศิริประเสิรฐ','M','SKE',0,NULL),(370,'5810546692','พุฒิเมธ เจียรจรัสพงศ์','M','SKE',0,NULL),(371,'5810546706','ภิรมย์สุรางค์ รุ่งเสรีชัย','F','SKE',0,NULL),(372,'5810546714','เมธาวี อภินัยณรงค์','F','SKE',0,NULL),(373,'5810546722','รักกาล จินตเสถียร','M','SKE',0,NULL),(374,'5810545378','กฤษณนัยน์ ดำรงค์พิพิธชัย','M','SKE',0,NULL),(375,'5810545386','ชญานิน ปัญจคุณาภรณ์','M','SKE',0,NULL),(376,'5810545394','ธนดล จันทร์สิทธิพงศ์','M','SKE',0,NULL),(377,'5810545408','ธนพล มีสัตย์','M','SKE',0,NULL),(378,'5810545416','ธนัช สัจจกุลนุกิจ','M','SKE',0,NULL),(379,'5810545424','ธีธัช ระแบบเลิศ','M','SKE',0,NULL),(380,'5810545432','ปฏิพล หวังใจธรรม','M','SKE',0,NULL),(381,'5810545441','ปาลิตา สำโรงพล','F','SKE',0,NULL),(382,'5810545467','วริศรา อินพรหม','F','SKE',0,NULL),(383,'5810545475','ศิวกร ศรีบุญเรือง','M','SKE',0,NULL),(384,'5810545483','ศุภวิชญ์ สุพรัตน์','M','SKE',0,NULL),(385,'5810545491','สรวิศ เลาวกุล','M','SKE',0,NULL),(386,'5810545505','อัครชัย ภาสวรนันทน์','M','SKE',0,NULL),(387,'5810545025','รอมฎอน ตีโด','M','SKE',0,NULL),(388,'5810545017','ธีรศานต์ ฉัตรวงศ์วาน','M','SKE',0,NULL),(389,'5810546030','ศศิมา บะวงศ์','F','SKE',0,NULL),(390,'5810545963','พงศ์ศิรัส อุปถัมภานนท์','M','SKE',0,NULL),(391,'5810545939','นาคสิทธิ์ สิทธินาค','M','SKE',0,NULL),(392,'5810546633','ณัฐนรี จับจุ','F','SKE',0,NULL);
/*!40000 ALTER TABLE `register` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2015-08-21 13:13:47
